#include"Introduction.h"
#include<iostream>

using namespace std;

void Introduction::print()
{
	cout << endl;
	cout << "\t\t\t\t\t\t\t踩地雷" << endl;
	cout << "\t" << "********************************************************************************************************" << endl;
	cout << "\t" << "*\t遊戲開始時，玩家可看到空白方塊排成的矩形，方塊數可由玩家自行選擇。                             *" << endl;
	cout << "\t" << "*\t如果是第一次點開方塊則不會踩到地雷。如果玩家點開沒有地雷的方塊，會有一個數字顯現其上，         *" << endl;
	cout << "\t" << "*\t這個數字代表著鄰近方塊有多少顆地雷(數字至多為16)，玩家須運用邏輯來推斷哪些方塊含或不含地雷。   *" << endl;
	cout << "\t" << "********************************************************************************************************" << endl << endl;
}
